// Вывести квадрат числа

Console.Clear();
double a, sqw=0;
string s;
Console.Write("Введите целое число до которого необходимо подсчитать сумму чётных чисел а=");
s=Console.ReadLine();
a=Convert.ToDouble(s);

sqw=a*a;
System.Console.WriteLine("Квадрат заданного числа: {0}", sqw);


